[{"id":7018,"wikiaId":3305,"title":"Affray at Greenwich","url":"\/wiki\/Affray_at_Greenwich","articleType":"article","teaser":"The Affray at Greenwich was a confrontation between Thor Odinson and Malekith the Accursed that...","thumbnail":null,"aliases":[{"id":1145,"title":"Affray at Greenwich"}],"sections":[{"id":15674,"title":"Affray at Greenwich","level":1,"content":[{"id":24663,"type":"paragraph","text":"The Affray at Greenwich was a confrontation between Thor Odinson and Malekith the Accursed that began and ended on the campus of the Old Royal Naval College in Greenwich, London.","links":[{"id":7793,"alias":"Thor Odinson"}],"elements":[]},{"id":24664,"type":"paragraph","text":"The confrontation necessitated the clean-up mission which opened \u0022The Well\u0022.","links":[{"id":7794,"alias":"The Well"}],"elements":[]}],"images":[]},{"id":15675,"title":"Appearances","level":2,"content":[{"id":24665,"type":"list","text":null,"links":[],"elements":[{"id":6387,"text":"Thor: The Dark World","links":[{"id":7795,"alias":"Thor"}]},{"id":6388,"text":"Agents of S.H.I.E.L.D.: \u0022The Well\u0022","links":[{"id":7796,"alias":"Agents of S.H.I.E.L.D."},{"id":7797,"alias":"The Well"}]}]}],"images":[]}]},{"id":7019,"wikiaId":2154,"title":"Affray at Harlem","url":"\/wiki\/Affray_at_Harlem","articleType":"article","teaser":"The Affray at Harlem was a confrontation between Bruce Banner (in the form of the Hulk) and Emil...","thumbnail":null,"aliases":[{"id":1146,"title":"Affray at Harlem"}],"sections":[{"id":15676,"title":"Affray at Harlem","level":1,"content":[{"id":24666,"type":"paragraph","text":"The Affray at Harlem was a confrontation between Bruce Banner (in the form of the Hulk) and Emil Blonsky (in the form of the Abomination) in the New York City neighborhood of Harlem.","links":[{"id":7798,"alias":"New York City"}],"elements":[]},{"id":24667,"type":"paragraph","text":"The skirmish began shortly after Blonsky forced Samuel Sterns to administer a dose of Banner\u0027s blood, thereby transforming Blonsky into the Abomination. Blonsky fled the laboratory near 121st Street and Broadway with the Army and NYPD in pursuit. Soldiers notified Lt. Gen. Thaddeus Ross of the rampage, incorrectly identifying Blonsky as the Hulk, without knowing that Ross was traveling with Banner in his custody.","links":[],"elements":[]},{"id":24668,"type":"paragraph","text":"Ross ordered his transport helicopter to return to New York City where Banner leapt from the airborne chopper, crashing into the street below before transforming into the Hulk. He and Blonsky then clashed in front of the Apollo Theater; Blonsky quickly overpowered Banner, throwing him down the length of 125th Street. Banner proceeded to rip a police cruiser in half, using the pieces as massive metallic boxing gloves to pummel Blonsky into the street.","links":[{"id":7799,"alias":"New York City"}],"elements":[]},{"id":24669,"type":"paragraph","text":"Blonsky managed to kick Banner into a neighboring apartment building, but was attacked with turret gun fire as Ross\u0027s helicopter arrived to provide air support. Blonsky fled across the rooftops and Banner pursued him until Blonsky leapt toward the helicopter, attempting to drag down the aircraft even as Banner clung to his back. Blonsky eventually forced the helicopter to crash-land in a construction site, where he and Banner continued their battle even as Banner witnessed Elizabeth Ross struggling to escape the wrecked chopper.","links":[],"elements":[]},{"id":24670,"type":"paragraph","text":"His concern for her gave him the strength to break free of Blonsky\u0027s grip, and when the helicopter\u0027s leaking fuel ignited, he created a shockwave to extinguish the flames. Blonsky then battered Banner with cement pylons attached to a chain and attempted to attack the Rosses as they escaped the helicopter, but Banner regained his strength, attacking Blonsky with his own chain and strangling him into submission. Banner only relented at Elizabeth\u0027s insistence, and when a backup helicopter arrived, Banner fled.","links":[],"elements":[]},{"id":24671,"type":"paragraph","text":"Blonsky was later transferred to a cryogenic facility outside Barrow, Alaska.","links":[],"elements":[]}],"images":[]},{"id":15677,"title":"Appearances","level":2,"content":[{"id":24672,"type":"list","text":null,"links":[],"elements":[{"id":6389,"text":"The Incredible Hulk","links":[]},{"id":6390,"text":"\u0022The Consultant\u0022 (mentioned)","links":[]}]}],"images":[]}]},{"id":7020,"wikiaId":2153,"title":"Affray at Puente Antiguo","url":"\/wiki\/Affray_at_Puente_Antiguo","articleType":"article","teaser":"The Affray at Puente Antiguo was a confrontation between Thor Odinson and the Destroyer in the...","thumbnail":null,"aliases":[{"id":1147,"title":"Affray at Puente Antiguo"},{"id":1527,"title":"Battle of Puente Antiguo"}],"sections":[{"id":15678,"title":"Affray at Puente Antiguo","level":1,"content":[{"id":24673,"type":"paragraph","text":"The Affray at Puente Antiguo was a confrontation between Thor Odinson and the Destroyer in the New Mexico town of Puente Antiguo. The skirmish began when Loki Laufeyson used the Bifrost to transport the Destroyer to the New Mexico desert of Earth outside of Puente Antiguo, where it destroyed a fleet of S.H.I.E.L.D. vehicles before proceeding into the town itself.","links":[{"id":7800,"alias":"Loki Laufeyson"},{"id":7801,"alias":"Thor Odinson"},{"id":7802,"alias":"S.H.I.E.L.D."}],"elements":[]},{"id":24674,"type":"paragraph","text":"Thor helped Jane Foster, Darcy Lewis and Erik Selvig to evacuate the town\u0027s civilians while Sif, Fandral, Hogun and Volstagg engaged the Destroyer even as it blasted surrounding businesses, houses, and a gas station. The machine battered the Asgardian warriors until the depowered Thor intervened, persuading his friends to fall back before approaching the Destroyer, offering himself as a sacrifice.","links":[{"id":7803,"alias":"Thor"},{"id":7804,"alias":"Sif"}],"elements":[]},{"id":24675,"type":"paragraph","text":"The machine threw Thor the length of the street, where he collapsed at Foster\u0027s feet and appeared to die, causing the Destroyer retreated. Moments later, however, Mjolnir dislodged itself from a nearby impact crater inside a S.H.I.E.L.D. facility where it was being studied and was summoned to the hand of Thor, who had finally proven himself worthy of its power. Thor awoke in a hail of lightning, his armor reassembling itself, and he hurled Mjolnir at the Destroyer before creating a massive whirlwind that lifted the machine off the ground into an airborne battle.","links":[{"id":7805,"alias":"S.H.I.E.L.D."},{"id":7806,"alias":"Thor"}],"elements":[]},{"id":24676,"type":"paragraph","text":"Thor used his warhammer to deflect the Destroyer\u0027s energy blasts, eventually forcing one of the machine\u0027s discharges back into it, causing it to implode and crash back to the ground. Having disabled the Destroyer, Thor, Sif, Fandral, Hogun and Volstagg returned to Asgard to confront Loki.","links":[{"id":7807,"alias":"Thor"},{"id":7808,"alias":"Sif"}],"elements":[]}],"images":[]},{"id":15679,"title":"Aftermath","level":3,"content":[{"id":24677,"type":"paragraph","text":"Following the skirmish, the disabled Destroyer armor was procured by S.H.I.E.L.D., who reverse engineered the technology as part of its Phase Two weapons project. Elements of the Destroyer armor were used to develop an experimental rifle that was later used by agent Phil Coulson against Loki.","links":[{"id":7809,"alias":"S.H.I.E.L.D."},{"id":7810,"alias":"Phil Coulson"}],"elements":[]}],"images":[]},{"id":15680,"title":"Appearances","level":2,"content":[{"id":24678,"type":"list","text":null,"links":[],"elements":[{"id":6391,"text":"Thor","links":[{"id":7811,"alias":"Thor"}]},{"id":6392,"text":"Agents of S.H.I.E.L.D.:","links":[{"id":7812,"alias":"Agents of S.H.I.E.L.D."}]}]}],"images":[]}]},{"id":7021,"wikiaId":2163,"title":"Affray at Rose Hill","url":"\/wiki\/Affray_at_Rose_Hill","articleType":"article","teaser":"The Affray at Rose Hill was a confrontation between Tony Stark and several Extremis-enhanced...","thumbnail":null,"aliases":[{"id":1148,"title":"Affray at Rose Hill"},{"id":1565,"title":"Rose Hill Skirmish"}],"sections":[{"id":15681,"title":"Affray at Rose Hill","level":1,"content":[{"id":24679,"type":"paragraph","text":"The Affray at Rose Hill was a confrontation between Tony Stark and several Extremis-enhanced soldiers that occurred in Rose Hill, Tennessee.","links":[{"id":7813,"alias":"Tony Stark"}],"elements":[]},{"id":24680,"type":"paragraph","text":"Stark had traveled to Rose Hill to investigate the death of Chad Davis, arranging to meet with his mother at a local bar. Ms. Davis offered Stark a confidential dossier of information that her son had collected before realizing that Stark was not the person she had been waiting to meet.","links":[],"elements":[]},{"id":24681,"type":"paragraph","text":"Moments later, Stark was assaulted by Ellen Brandt, who attempted to arrest Stark before she was interrupted by a Rose Hill deputy sheriff. She killed the sheriff, and Stark fled the bar, encountering Eric Savin in the street before rushing into a nearby restaurant. Brandt pursued him inside, battering him badly until he lit a vat of oil on fire; Brandt endured the flames to continue her attack, but Stark improvised an explosive by severing a gas line and activating a microwave oven with a set of dog tags inside. The blast destroyed the building, killing Brandt and hurling her body into a tangle of overhead electrical wires.","links":[],"elements":[]},{"id":24682,"type":"paragraph","text":"Stark fled, but found Savin weakening the leg of a water tower, which subsequently collapsed, dousing Stark in a deluge and pinning his legs under the debris. Savin then approached Stark with Harley Keener as a hostage, demanding that Stark return Davis\u0027s file, but Harley distracted Savin with a blinding blast from one of Stark\u0027s repulsor diodes, and Stark disabled Savin with a blast from a palm-repulsor in his sleeve.","links":[],"elements":[]}],"images":[]},{"id":15682,"title":"Aftermath","level":3,"content":[{"id":24683,"type":"paragraph","text":"Following the attack, Stark recovered Davis\u0027s file and left Rose Hill.","links":[],"elements":[]},{"id":24684,"type":"paragraph","text":"Savin subsequently recovered from the altercation.","links":[],"elements":[]}],"images":[]},{"id":15683,"title":"Appearances","level":2,"content":[{"id":24685,"type":"list","text":null,"links":[],"elements":[{"id":6393,"text":"Iron Man 3","links":[]}]}],"images":[]}]},{"id":7022,"wikiaId":2158,"title":"Affray at Stark Industries","url":"\/wiki\/Affray_at_Stark_Industries","articleType":"article","teaser":"The Affray at Stark Industries was a confrontation between Tony Stark (wearing his Iron Man Mark...","thumbnail":null,"aliases":[{"id":1149,"title":"Affray at Stark Industries"}],"sections":[{"id":15684,"title":"Affray at Stark Industries","level":1,"content":[{"id":24686,"type":"paragraph","text":"The Affray at Stark Industries was a confrontation between Tony Stark (wearing his Iron Man Mark III armor) and Obadiah Stane (wearing the Iron Monger armor) at the headquarters of Stark Industries in New York City.","links":[{"id":7814,"alias":"Stark Industries"},{"id":7815,"alias":"New York City"},{"id":7816,"alias":"Tony Stark"}],"elements":[]}],"images":[]},{"id":15685,"title":"Prelude","level":3,"content":[{"id":24687,"type":"paragraph","text":"Stane obtained the schematics for the Iron Monger armor from a terrorist organization known as the Ten Rings, who had in turn reverse engineered the designs from an improvised suit of armor built by Tony Stark, who they had abducted on orders from Stane.","links":[{"id":7817,"alias":"Tony Stark"}],"elements":[]},{"id":24688,"type":"paragraph","text":"After Stark\u0027s return to the United States and his public announcement that Stark Industries would no longer develop weapons, Stane ordered the secret production of the Iron Monger suit, and stole the miniaturized Arc Reactor from Stark\u0027s chestpiece to power it. Stark nearly died as a result, but managed to reattach his original Arc Reactor and use it to power his latest suit.","links":[{"id":7818,"alias":"Stark Industries"}],"elements":[]}],"images":[]},{"id":15686,"title":"Confrontation","level":3,"content":[{"id":24689,"type":"paragraph","text":"When Stark\u0027s assistant Pepper Potts discovered evidence of Stane\u0027s illegal activities, she led S.H.I.E.L.D. agents, including Phil Coulson, to Stak Industries. Stane suited up in his Iron Monger armor and killed most of Coulson\u0027s team before preparing to kill Potts, but Stark arrived and tackled Stane.","links":[{"id":7819,"alias":"S.H.I.E.L.D."},{"id":7820,"alias":"Phil Coulson"},{"id":7821,"alias":"Coulson"}],"elements":[]},{"id":24690,"type":"paragraph","text":"The fight quickly spilled out onto a busy freeway, where Stane used passing cars and motorcycles as weapons to pummel Stark before firing a shoulder-mounted missile. Stark survived the explosion, launching himself into the atmosphere with Stane in pursuit; Stane caught up to Stark just as the Iron Monger suit suffered catastrophic icing, plummeting back down to Earth as Stark\u0027s weakened suit dropped to emergency power.","links":[],"elements":[]},{"id":24691,"type":"paragraph","text":"Stark crash-landed, but was attacked again by Stane, who had survived the fall; Stane attempted to crush Stark\u0027s suit, but Stark deployed flares that forced Stane to release him. Stark then contacted Potts and instructed her to \u0022overload the Reactor and blast the roof,\u0022 then attacked Stane and tore pieces of his Iron Monger suit in order to give Potts time to sabotage the Arc Reactor.","links":[],"elements":[]},{"id":24692,"type":"paragraph","text":"Stane managed to overpower Stark and nearly kill him, but Potts activated the Arc Reactor\u0027s override switch, sending up a massive stream of energy that disabled Stane\u0027s suit. Stane fell from the roof and collapsed into the Reactor\u0027s core, setting off a tremendous explosion that destroyed the building.","links":[],"elements":[]}],"images":[]},{"id":15687,"title":"Aftermath","level":3,"content":[{"id":24693,"type":"paragraph","text":"Following his battle with Stane, Tony Stark publicly announced that he was, in fact, the Iron Man. He was later approached at his home by S.H.I.E.L.D. Director Nick Fury, who indicated that Stark was not \u0022the only superhero in the world\u0022 and that he had become \u0022part of a bigger universe\u0022; Fury then explained that he wished to speak with Stark about the \u0022Avenger Initiative.\u0022","links":[{"id":7822,"alias":"S.H.I.E.L.D."},{"id":7823,"alias":"Tony Stark"},{"id":7824,"alias":"Nick Fury"}],"elements":[]}],"images":[]},{"id":15688,"title":"Appearances","level":2,"content":[{"id":24694,"type":"list","text":null,"links":[],"elements":[{"id":6394,"text":"Iron Man","links":[]}]}],"images":[]}]},{"id":7023,"wikiaId":2159,"title":"Affray at the Monaco Grand Prix","url":"\/wiki\/Affray_at_the_Monaco_Grand_Prix","articleType":"article","teaser":"The Affray at the Monaco Grand Prix was a confrontation between Tony Stark (wearing his Iron Man...","thumbnail":null,"aliases":[{"id":1150,"title":"Affray at the Monaco Grand Prix"}],"sections":[{"id":15689,"title":"Affray at the Monaco Grand Prix","level":1,"content":[{"id":24695,"type":"paragraph","text":"The Affray at the Monaco Grand Prix was a confrontation between Tony Stark (wearing his Iron Man Mark III armor) and Ivan Vanko (wearing his Whiplash Mark 1 harness) at the Circuit de Monaco in Monte Carlo.","links":[{"id":7825,"alias":"Tony Stark"}],"elements":[]}],"images":[]},{"id":15690,"title":"Prelude","level":3,"content":[{"id":24696,"type":"paragraph","text":"After obtaining a forged passport, Vanko traveled to Monaco and infiltrated the Grand Prix by posing as a safety worker named \u0022Boris Turgenov\u0022. While attending the Grand Prix as the owner of a car in the race, Stark decided to pull his driver and operate the Formula One racer himself.","links":[],"elements":[]}],"images":[]},{"id":15691,"title":"The Affray","level":3,"content":[{"id":24697,"type":"paragraph","text":"After the race had begun, Vanko stepped onto the track and activated his harness, which burned away his jumpsuit. He then attacked car #6, slicing the front end of the vehicle in half and causing the car to cartwheel down the track. Witnessing the attack on live television from the bar of a nearby hotel, Pepper Potts and Happy Hogan rushed to the racetrack, crashing onto the course in Stark\u0027s Rolls-Royce Phantom Coupé and driving against traffic in order to deliver Stark\u0027s mobile Iron Man armor.","links":[],"elements":[]},{"id":24698,"type":"paragraph","text":"Vanko next attacked Stark\u0027s #11 car as it rounded the corner, severing the entire front end of the vehicle and causing it to flip down the track and crash into the wreck of car #6. As Vanko approached Stark\u0027s car, three more racers rounded the corner and crashed behind him, cartwheeling down the track as well. When Vanko reached Stark\u0027s crashed car, he sliced the wreck in half in an attempt to kill Stark, but discovered the vehicle empty; Stark then attacked Vanko from behind, hitting him in the head with a piece of debris.","links":[],"elements":[]},{"id":24699,"type":"paragraph","text":"Vanko proceeded to beat back Stark with his electrified whips until Stark collided with a car and spotted fuel leaking from the vehicle\u0027s gas tank. Stark waited while Vanko approached, diving away when Vanko swung at him, causing Vanko to ignite the fuel and blow up the car. Moments later, Hogan reached the scene, crashing the Rolls-Royce into Vanko and pinning him to the track wall, but Vanko survived the impact and assaulted the car, cutting it to pieces. Potts finally managed to deliver Stark\u0027s briefcase to him, and Stark suited up in his Mark V armor.","links":[],"elements":[]},{"id":24700,"type":"paragraph","text":"Stark then shoved the Rolls-Royce down the track and away from Vanko and fired repulsor blasts at him which Vanko deflected with his whips. Vanko then tangled Stark in his whips and used them to hurl Stark into the Rolls-Royce before dragging him to the ground and weakening his suit with an electrical surge. Stark retaliated by further tangling himself in Vanko\u0027s whip, using it to get close enough to batter Vanko and flip him onto the asphalt. Stark then ripped Vanko\u0027s power source from his chest, deactivating his harness as riot police moved in to secure Vanko.","links":[],"elements":[]}],"images":[]},{"id":15692,"title":"Aftermath","level":3,"content":[{"id":24701,"type":"paragraph","text":"Even as he was dragged away by police, Vanko laughed at Stark, insisting that Stark \u0022will lose.\u0022 Identifying Vanko\u0027s power source as a rudimentary Arc Reactor, Stark crushed the device, destroying it.","links":[],"elements":[]},{"id":24702,"type":"paragraph","text":"Stark later confronted Vanko in a French prison, and learned that Vanko was the son of Anton Vanko, who had worked with Stark\u0027s father to develop the Arc Reactor. Vanko revealed that he had not meant to kill Stark, but only to wound him and destroy his reputation of invincibility, opening the floodgates to more attacks on Stark by others.","links":[],"elements":[]},{"id":24703,"type":"paragraph","text":"Vanko also revealed his knowledge of Stark\u0027s palladium poisoning, calling it a \u0022painful way to die.\u0022","links":[],"elements":[]}],"images":[]},{"id":15693,"title":"Appearances","level":2,"content":[{"id":24704,"type":"list","text":null,"links":[],"elements":[{"id":6395,"text":"Iron Man 2","links":[]}]}],"images":[]}]},{"id":7025,"wikiaId":10841,"title":"Agent Carter","url":"\/wiki\/Agent_Carter","articleType":"article","teaser":"Marvel\u0027s Agent Carter is an upcoming television show. It will star Hayley Atwell as Agent Peggy...","thumbnail":"http:\/\/img4.wikia.nocookie.net\/__cb20140524191249\/agentsofshield\/images\/thumb\/e\/ef\/Agent_carter_logo.jpg\/200px-207%2C737%2C0%2C529-Agent_carter_logo.jpg","aliases":[{"id":1152,"title":"Agent Carter"}],"sections":[{"id":15695,"title":"Agent Carter","level":1,"content":[{"id":24706,"type":"paragraph","text":"Marvel\u0027s Agent Carter is an upcoming television show. It will star Hayley Atwell as Agent Peggy Carter. It is set after the events of Captain America: The First Avenger and Marvel One Shot: Agent Carter. On May 8, 2014 Marvel Entertainment announced that ABC picked up Agent Carter to the series, to air between the two halves of Season 2 of Agents of S.H.I.E.L.D..","links":[{"id":7826,"alias":"Agents of S.H.I.E.L.D."},{"id":7827,"alias":"Captain America"},{"id":7828,"alias":"May"}],"elements":[]}],"images":[{"id":28295,"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140524191249\/agentsofshield\/images\/thumb\/e\/ef\/Agent_carter_logo.jpg\/250px-Agent_carter_logo.jpg","caption":null,"elements":[]}]}]},{"id":7043,"wikiaId":2195,"title":"Assault at Culver University","url":"\/wiki\/Assault_at_Culver_University","articleType":"article","teaser":"The Assault at Culver University was an attack on Bruce Banner by a battalion of United States...","thumbnail":"http:\/\/img4.wikia.nocookie.net\/__cb20140403164044\/agentsofshield\/images\/thumb\/4\/46\/Wikia_SHIELD_-_Culver_Hulk_appears.png\/200px-260%2C639%2C0%2C378-Wikia_SHIELD_-_Culver_Hulk_appears.png","aliases":[{"id":1170,"title":"Assault at Culver University"}],"sections":[{"id":15733,"title":"Assault at Culver University","level":1,"content":[{"id":24767,"type":"paragraph","text":"The Assault at Culver University was an attack on Bruce Banner by a battalion of United States Army soldiers, including the Supersoldier Serum-enhanced Emil Blonsky, led by Thaddeus Ross at the campus of Culver University.","links":[{"id":7966,"alias":"Supersoldier Serum"}],"elements":[]}],"images":[]},{"id":15734,"title":"Prelude","level":3,"content":[{"id":24768,"type":"paragraph","text":"After spending years on the run following the disastrous experiment that transformed him into the Hulk, Dr. Banner returned to Culver University and contacted Elizabeth Ross in order to retrieve the research the two had done as part of their original experiment.","links":[],"elements":[]},{"id":24769,"type":"paragraph","text":"At the same time, Elizabeth\u0027s father, General Ross, agreed to have one of his soldiers, Captain Emil Blonsky, administered a low dose of Abraham Erskine\u0027s supersoldier serum. Ross later learned from his daughter\u0027s new boyfriend, Leonard Samson, that Banner had made contact with Elizabeth.","links":[{"id":7967,"alias":"Abraham Erskine"}],"elements":[]}],"images":[]},{"id":15735,"title":"Assault","level":3,"content":[{"id":24770,"type":"paragraph","text":"The following day, Elizabeth escorted Banner to the bus station at the campus of Culver University. Before Elizabeth could lead, Banner spotted soldiers approaching, and fled with a contingent of Humvees in pursuit followed by an armored tank carrying General Ross. Banner spotted the enhanced Blonsky chasing him on foot at superhuman speed, and rushed into the University library building to evade capture. Inside, he forced himself to swallow the flashdrive containing his and Ross\u0027s research data, then fled again with soldiers in pursuit.","links":[],"elements":[]},{"id":24771,"type":"paragraph","text":"Outside the library, Elizabeth confronted her father just as Banner reached the windowed overpass between buildings, where he was pinned by soldiers who fired gas-canisters into the enclosure. Elizabeth rushed toward the library as gas filled the overpass; Banner watched as she was tackled by soldiers, and became so enraged by the sight that he transformed into the Hulk, bursting through the window and leaping to the lawn below.","links":[],"elements":[]},{"id":24772,"type":"paragraph","text":"A squad of soldiers opened fire with machine guns, and Banner charged toward them, overturning one Humvee and shattered another when they fired on him with 50 caliber turret guns. He then hurled the engine from one of the vehicles across the lawn, causing two military trucks to explode. Blonsky then moved in with a grenade launcher, and Banner ripped free two massive sheets of shrapnel to use as shields, but Blonsky rushed at Banner, leaping over the Hulk repeatedly and firing on him with a handgun. As Banner swung at Blonsky with the sheets of shrapnel, Blonsky managed to narrowly avoid the attack due to his supersoldier enhancements.","links":[],"elements":[]},{"id":24773,"type":"paragraph","text":"As a pair of Humvees armed with sonic cannons approached, Blonsky fled across the lawn, leading the Hulk into the line of fire as soldiers activated two acoustic weapons. One blast grazed Blonsky, but the attack termporarily incapacitated the Hulk as Ross ordered his daughter removed from the grounds. The sound of Elizabeth screaming at her father to stop once more enraged the Hulk until he managed to hurl a sheet of shrapnel at one Humvee, disabling its sonic cannon as he leapt at the second vehicle, smashing its weapons. Blonsky then retrieved a machine gun and fired at the Hulk before approaching him and demanding to know if \u0022that [is] all you got?\u0022 The Hulk promptly kicked Blonsky across the lawn and into a tree, shattering most of the bones in his body.","links":[],"elements":[]},{"id":24774,"type":"paragraph","text":"Ross then ordered his battalion to retreat, and Elizabeth approached the Hulk as a gunship arrived, opening fire on Banner. When Ross realized that his daughter was with the Hulk, he ordered the helicopter to stand down, but Banner flung a sheet of shrapnel at the incoming aircraft, severing its propellers. The gunship promptly crashed, exploding as the Hulk shielded Elizabeth from the fiery wreck. Banner then left the scene with the unconscious Elizabeth as General Ross looked on.","links":[],"elements":[]}],"images":[{"id":28299,"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140403164044\/agentsofshield\/images\/thumb\/4\/46\/Wikia_SHIELD_-_Culver_Hulk_appears.png\/180px-Wikia_SHIELD_-_Culver_Hulk_appears.png","caption":"","elements":[]}]},{"id":15736,"title":"Appearances","level":2,"content":[{"id":24775,"type":"list","text":null,"links":[],"elements":[{"id":6444,"text":"The Incredible Hulk","links":[]}]}],"images":[]}]},{"id":7044,"wikiaId":2185,"title":"Assault in Kunar Province","url":"\/wiki\/Assault_in_Kunar_Province","articleType":"article","teaser":"The Assault in Kunar Province was an attack on a United States Air Force convoy by members of...","thumbnail":null,"aliases":[{"id":1171,"title":"Assault in Kunar Province"}],"sections":[{"id":15737,"title":"Assault in Kunar Province","level":1,"content":[{"id":24776,"type":"paragraph","text":"The Assault in Kunar Province was an attack on a United States Air Force convoy by members of the Ten Rings terrorist organization in Afghanistan.","links":[],"elements":[]},{"id":24777,"type":"paragraph","text":"Weapons developer Tony Stark had traveled to Bagram Air Base in the Parwān Province to host a demonstration of the Stark Industries Jericho warhead for a group of Army representatives in neighboring Kunar Province. Following the demonstration, a convoy of five Humvees transported Stark back to Bagram, but was attacked by a contingent of terrorists.","links":[{"id":7968,"alias":"Stark Industries"},{"id":7969,"alias":"Tony Stark"}],"elements":[]},{"id":24778,"type":"paragraph","text":"All of the soldiers were killed in the attack, and Stark was incapacitated with one of his company\u0027s own explosives. Stark was subsequently taken hostage by the Ten Rings and kept prisoner in a cave where he was saved by fellow captive Ho Yinsen, who installed a small electromagnet into Stark\u0027s chest in order to keep the shrapnel of his bomb from reaching his heart. Stark was ordered by his captors to build a replica of the Jericho warhead for the Ten Rings, but Stark instead built a miniature arc reactor to power Yinsen\u0027s electromagnet and constructed a suit of armor.","links":[],"elements":[]},{"id":24779,"type":"paragraph","text":"When the suit was fully powered, Stark staged an escape, during which Yinsen was killed and the entire Ten Rings facility was destroyed. Stark fled into the desert, and was rescued by a unit of American soldiers led by James Rhodes.","links":[],"elements":[]}],"images":[]},{"id":15738,"title":"Aftermath","level":3,"content":[{"id":24780,"type":"paragraph","text":"Stark later learned that his capture was orchestrated by Obadiah Stane in an attempt by Stane to take over Stark Industries.","links":[{"id":7970,"alias":"Stark Industries"}],"elements":[]},{"id":24781,"type":"paragraph","text":"Members of the Ten Rings eventually located the pieces of Stark\u0027s Mark I suit and attempted to reassemble them. Stane later traveled to Afghanistan to retrieve the suit, slaughtering the cell of terrorists and using Stark\u0027s improvised design to create the Iron Monger Armor.","links":[],"elements":[]}],"images":[]},{"id":15739,"title":"Appearances","level":2,"content":[{"id":24782,"type":"list","text":null,"links":[],"elements":[{"id":6445,"text":"Iron Man","links":[]}]}],"images":[]}]},{"id":7045,"wikiaId":2156,"title":"Assault on Air Force One","url":"\/wiki\/Assault_on_Air_Force_One","articleType":"article","teaser":"The Assault on Air Force One was an aerial attack aboard the airplane of the President that was...","thumbnail":null,"aliases":[{"id":1172,"title":"Assault on Air Force One"}],"sections":[{"id":15740,"title":"Assault on Air Force One","level":1,"content":[{"id":24783,"type":"paragraph","text":"The Assault on Air Force One was an aerial attack aboard the airplane of the President that was launched by Eric Savin, under orders from Aldrich Killian, using a Iron Patriot suit stolen from James Rhodes.","links":[],"elements":[]}],"images":[]},{"id":15741,"title":"Prelude","level":3,"content":[{"id":24784,"type":"paragraph","text":"In an attempt to bring an end to the Mandarin\u0027s reign of terror, Rhodes was dispatched around the Middle East in redesigned War Machine armor – bearing the moniker of the Iron Patriot – to run down leads on the terrorist\u0027s whereabouts, however, none of the locations proved correct. While liberating a sweatshop staffed with women, however, Rhodes was attacked by an Extremis enhance who disabled his armor with a blast of energy.","links":[],"elements":[]},{"id":24785,"type":"paragraph","text":"The Iron Patriot armor was then delivered, with Rhodes still inside, to the compound of Aldrich Killian, where Rhodes was eventually forced to abandon his suit when Killian superheated the suit. Rhodes attacked Savin, but was subdued by Killian as Savin suited up as the Iron Patriot and left the compound to meet up with President Ellis. Rhodes escaped custody and met up with Tony Stark, who had discovered the compound in his search for the Mandarin, and the two attempted to warn Vice President Rodriguez of the threat to the President.","links":[{"id":7971,"alias":"Tony Stark"}],"elements":[]},{"id":24786,"type":"paragraph","text":"Rodriguez assured them that he would relay the message to Secret Service, but subsequently did not, having secretly agreed to a deal with Killian: after the assassination of the President and the ascension of Rodriguez to the White House, Rodriguez planned to rubberstamp defense contracts for Killian\u0027s company in exchange for receiving the Extremis serum to treat his daughter\u0027s infirmity.","links":[{"id":7972,"alias":"Extremis serum"}],"elements":[]}],"images":[]},{"id":15742,"title":"The Assault","level":3,"content":[{"id":24787,"type":"paragraph","text":"Savin then met with Ellis and boarded Air Force One; at five o\u0027clock, he proceeded to the President\u0027s conference room and killed everyone except for Ellis. Savin then forced Ellis into the Iron Patriot armor, which was remotely programmed to fly the President to a salvaged Roxxon oil tanker.","links":[],"elements":[]},{"id":24788,"type":"paragraph","text":"As Savin attempted to parachute from the plane, he was attacked by Stark\u0027s remotely-piloted Mark 42 suit. Savin nearly disabled Stark\u0027s armor, blasting a hole in the tail-end of the plane that dragged more than a dozen passengers out into freefall. The Mark 42 then killed Savin with a single blast from its chest repulsor before leaping from the plane, which subsequently broke up and exploded in flight.","links":[],"elements":[]}],"images":[]},{"id":15743,"title":"Aftermath","level":3,"content":[{"id":24789,"type":"paragraph","text":"The Mark 42 proceeded to execute a midair rescue of all thirteen passengers, picking them up individually to form a human chain and slowing their descent in order to deposit them safely in a river.","links":[],"elements":[]},{"id":24790,"type":"paragraph","text":"The abduction of President Ellis led to a rescue operation by Stark and Rhodes that resulted in a skirmish aboard the Narco.","links":[],"elements":[]}],"images":[]},{"id":15744,"title":"Appearances","level":2,"content":[{"id":24791,"type":"list","text":null,"links":[],"elements":[{"id":6446,"text":"Iron Man 3","links":[]}]}],"images":[]}]},{"id":7046,"wikiaId":2186,"title":"Assault on Gulmira","url":"\/wiki\/Assault_on_Gulmira","articleType":"article","teaser":"The Assault on Gulmira was a brief, armed attack on terrorists associated with the Ten Rings by...","thumbnail":null,"aliases":[{"id":1173,"title":"Assault on Gulmira"}],"sections":[{"id":15745,"title":"Assault on Gulmira","level":1,"content":[{"id":24792,"type":"paragraph","text":"The Assault on Gulmira was a brief, armed attack on terrorists associated with the Ten Rings by industrialist Tony Stark (wearing his Iron Man Mark III armor) that took place in the town of Gulmira in Afghanistan.","links":[{"id":7973,"alias":"Tony Stark"}],"elements":[]},{"id":24793,"type":"paragraph","text":"After seeing a news broadcast on a terrorist takeover of Gulmira (the hometown of the Ho Yinsen), Stark traveled to Afghanistan in his Iron Man armor to avenge the man who had saved his life. Stark killed all but one of the terrorists in just thirty seconds, leaving the last man to the mercy of the townspeople before taking off.","links":[],"elements":[]},{"id":24794,"type":"paragraph","text":"While in flight after leaving the town, Stark targeted the Stark Industries missiles at a Ten Rings weapons depot, but he was shot down by a tank; after crash-landing, Stark returned fire, blowing up the tank with a small missile before coming under machine gun fire. As he launched again, he destroyed a Jericho missile launcher with his palm-repulsor, incinerating the entire depot before leaving the country.","links":[{"id":7974,"alias":"Stark Industries"}],"elements":[]}],"images":[]},{"id":15746,"title":"Aftermath","level":2,"content":[{"id":24795,"type":"paragraph","text":"As Stark attempted to return to the United States, he was intercepted by a pair of F-22 Raptors that engaged him as a hostile. Stark evaded their attacks, inadvertently destroying one of the fighter jets and forcing its pilot to eject. When the pilot\u0027s parachute failed to deploy, Stark chased the plummeting man and manually deploying the parachute before fleeing from the second jet and escaping.","links":[],"elements":[]}],"images":[]},{"id":15747,"title":"Appearances","level":2,"content":[{"id":24796,"type":"list","text":null,"links":[],"elements":[{"id":6447,"text":"Iron Man","links":[]}]}],"images":[]}]},{"id":7047,"wikiaId":3304,"title":"Assault on Odin\u0027s Palace","url":"\/wiki\/Assault_on_Odin%27s_Palace","articleType":"article","teaser":"The Assault on Odin\u0027s Palace was an attack on the palace of Odin Borson in Asgard that was...","thumbnail":null,"aliases":[{"id":1174,"title":"Assault on Odin\u0027s Palace"},{"id":1526,"title":"Assault on Valaskjalf"}],"sections":[{"id":15748,"title":"Assault on Odin\u0027s Palace","level":1,"content":[{"id":24797,"type":"paragraph","text":"The Assault on Odin\u0027s Palace was an attack on the palace of Odin Borson in Asgard that was launched by Malekith the Accursed in an attempt to kidnap the Midgardian Jane Foster.","links":[],"elements":[]}],"images":[]},{"id":15749,"title":"Prelude","level":3,"content":[{"id":24798,"type":"paragraph","text":"Awoken by the presence of the Aether as it bonded with Jane Foster, the Dark Elf Malekith hid a stone of magical magma inside the abdomen of his warrior Algrim, who he then sent into battle in order for Algrim to be captured by the forces of Asgard. Taken prisoner, Algrim was then delivered by Fandral and Volstagg to the dungeons below Odin\u0027s palace, where he extracted the magma stone and crushed it in his hand, transforming into the indestructible Kurse.","links":[],"elements":[]}],"images":[]},{"id":15750,"title":"The Assault","level":3,"content":[{"id":24799,"type":"paragraph","text":"Kurse broke free of his cell and killed two guards before releasing the rest of the prisoners with the exception of Loki Laufeyson, though Loki still chose to advise Kurse to use \u0022the stairs to the left.\u0022 The soldiers of Asgard, including Fandral and Volstagg, quickly responded and were joined by Thor Odinson, who left the visiting Midgardian Jane Foster in his mother\u0027s care. Frigga then armed herself before retreating to her own chambers with Foster, while Odin assigned a unit of soldiers to protect the weapon\u0027s vault and another to provide support to Thor, Fandral and Volstagg in the dungeons.","links":[{"id":7975,"alias":"Loki Laufeyson"},{"id":7976,"alias":"Thor Odinson"},{"id":7977,"alias":"Thor"}],"elements":[]},{"id":24800,"type":"paragraph","text":"With Odin\u0027s soldiers occupied quelling the dungeon prisonbreak, a cloaked Dark Elf stealth fighter approached the city. Sensing the ship, Heimdall rushed from his observatory and scaled one of the Bifrost\u0027s main suspension cables, leaping from the top of the tower onto the invisible ship and deactivating its cloaking capabilities by breaching its hull with a pair of longknives. He then disabled the ship, leaping to safety as the ship crashed across the Bifrost; moments later, Malekith\u0027s warship appeared above the observatory and released a squadron of three more stealth fighters.","links":[],"elements":[]},{"id":24801,"type":"paragraph","text":"The fighter crafts quickly navigated the city, avoiding Asgardian laser-cannon fire before engaging a platoon of Asgardian skiffs in a dogfight. Two skiffs and one fighter were destroyed in the skirmish as Heimdall returned to the observatory to remotely activate a generator within Odin\u0027s Palace in an attempt to raise the shield around the building, and a second fighter was destroyed when it crashed into the shield. Inside the Palace, Kurse ascended from the dungeons, slaughtering guards as he made his way to the shield generator, which he proceeded to destroy, deactivating the magical defenses around the palace to allow the final stealth fighter clear passage. The fighter proceeded to dodge laser fire before crashing directly into the palace\u0027s royal hall.","links":[],"elements":[]},{"id":24802,"type":"paragraph","text":"A platoon of Dark Elves emerged from the fighter, engaging a unit of Asgardian soldiers with laser-rifles and singularity grenades. Malekith then entered the fray, using a singularity grenade to destroy Hlidskjalf, the Throne of Odin, before leaving the skirmish to search out Frigga\u0027s chambers, where he discovered Frigga and Foster. Frigga ordered Malekith to stand down and he refused, demanding that Frigga turn over Foster to him. Frigga responded by attacking Malekith, disarming him, and nearly defeating him before she was overpowered by Kurse. Malekith then ordered Foster to relinquish the Aether, though he quickly discovered that Foster was actually a projected image. Frigga refused to reveal Foster\u0027s location, and was promptly stabbed to death by Kurse.","links":[{"id":7978,"alias":"Dark Elves"}],"elements":[]},{"id":24803,"type":"paragraph","text":"Moments later, Thor arrived, blasting half of Malekith\u0027s face with lightning before Kurse and Malekith escaped in a waiting stealth fighter; Thor hurled his hammer at the fighter, but it and Malekith\u0027s warship dematerialized. Odin then arrived and tended to his murdered wife as Thor and Foster looked on.","links":[{"id":7979,"alias":"Thor"}],"elements":[]}],"images":[]},{"id":15751,"title":"Aftermath","level":3,"content":[{"id":24804,"type":"paragraph","text":"Frigga received a Norse funeral, during which her life-force was returned to the universe. Malekith was placed in a rehabilitation pod, though he retained blackened scarring on half of his face. Among the prisoners who escaped during Kurse\u0027s rampage was Lorelei, who later used one of Loki\u0027s secret portals to travel to Midgard.","links":[{"id":7980,"alias":"Lorelei"}],"elements":[]}],"images":[]},{"id":15752,"title":"Appearances","level":2,"content":[{"id":24805,"type":"list","text":null,"links":[],"elements":[{"id":6448,"text":"The Dark World","links":[]},{"id":6449,"text":"Agents of S.H.I.E.L.D.:","links":[{"id":7981,"alias":"Agents of S.H.I.E.L.D."}]}]}],"images":[]}]},{"id":7069,"wikiaId":2161,"title":"Bombing of the Chinese Theatre","url":"\/wiki\/Bombing_of_the_Chinese_Theatre","articleType":"article","teaser":"The Bombing of the Chinese Theatre in Hollywood occurred when Eric Savin delivered a dose of the...","thumbnail":null,"aliases":[{"id":1196,"title":"Bombing of the Chinese Theatre"}],"sections":[{"id":15797,"title":"Bombing of the Chinese Theatre","level":1,"content":[{"id":24882,"type":"paragraph","text":"The Bombing of the Chinese Theatre in Hollywood occurred when Eric Savin delivered a dose of the Extremis serum to Jack Taggart, who was unable to regulate the serum. Extremis subsequently consumed Taggart\u0027s body and detonated, vaporizing dozens of civilians and critically injuring Happy Hogan, who had been tracking Savin.","links":[{"id":8121,"alias":"Extremis serum"}],"elements":[]}],"images":[]},{"id":15798,"title":"Appearances","level":2,"content":[{"id":24883,"type":"list","text":null,"links":[],"elements":[{"id":6494,"text":"Iron Man 3","links":[]}]}],"images":[]}]},{"id":7300,"wikiaId":2194,"title":"Roxxon Norco Skirmish","url":"\/wiki\/Roxxon_Norco_Skirmish","articleType":"article","teaser":"The Roxxon Norco Skirmish was a conflict between a fleet of armored suits controlled by Tony...","thumbnail":null,"aliases":[{"id":1427,"title":"Roxxon Norco Skirmish"}],"sections":[{"id":16366,"title":"Roxxon Norco Skirmish","level":1,"content":[{"id":25888,"type":"paragraph","text":"The Roxxon Norco Skirmish was a conflict between a fleet of armored suits controlled by Tony Stark and James Rhodes and a battalion of Extremis-enhanced soldiers led by Aldrich Killian, an encounter which took place on the salvaged Norco oil tanker owned by the Roxxon Corporation.","links":[{"id":10520,"alias":"Tony Stark"}],"elements":[]}],"images":[]},{"id":16367,"title":"Prelude","level":3,"content":[{"id":25889,"type":"paragraph","text":"In order to force Stark to experience his own desperation, Killian had Pepper Potts kidnapped and injected with the Extremis serum. Later, using stolen Iron Patriot armor, Killian engineered the successful abduction of President Ellis, who had been delivered to the Norco in the remotely-piloted Iron Patriot suit.","links":[{"id":10521,"alias":"Extremis serum"}],"elements":[]},{"id":25890,"type":"paragraph","text":"Killian revealed his intention of killing the President and allowing the Mandarin to take credit for the assassination, thereby ensuring defense contracts from Ellis\u0027s successor, Vice President Rodriguez, for Killian\u0027s company.","links":[],"elements":[]}],"images":[]},{"id":16368,"title":"The Skirmish","level":3,"content":[{"id":25891,"type":"paragraph","text":"Stark and Rhodes reached the Norco shortly before the execution and engaged several of Killian\u0027s soldiers before being surrounded by enhanciles. Moments later, Stark\u0027s entire fleet of forty-two armored suits arrived to provide air support, and Stark ordered J.A.R.V.I.S. to \u0022target Extremis heat signature\u0022 and \u0022disable with extreme prejudice.\u0022 Stark\u0027s suits then attacked Killian\u0027s soldiers, setting off a chain of massive explosions as it killed several of the enhanciles.","links":[],"elements":[]},{"id":25892,"type":"paragraph","text":"Rhodes rushed to release President Ellis, fighting off a pair of Extremis soldiers before freeing the President, recovering the Iron Patriot armor, and evacuating Ellis from the scene. Stark also suited up in one of his own armors and located Potts aboard the Norco, moving in to rescue her before being interrupted by Killian. Stark severed Killian\u0027s left arm just before the floor of the platform collapsed, dropping Potts onto a moving scaffold. Stark gave chase and reached her in time, but failed to catch her as she fell two-hundred feet into a roiling fireball.","links":[],"elements":[]},{"id":25893,"type":"paragraph","text":"Enraged, Stark found Killian, summoned a suit, and battled the enhancile. When Killian pinned Stark and attempted to deal a death-blow, Stark ejected from the suit and summoned another, battering Killian with repulsor blasts even as Killian recovered from the blows. Stark ejected again as Killian severed the suit in half, and Killian prepared to kill the unarmored Stark when the Mark 42 arrived; Stark directed the Mark 42 to encase Killian, and ordered J.A.R.V.I.S. to destroy the suit, leaping from the scaffolding as the detonation collapsed the platform.","links":[],"elements":[]},{"id":25894,"type":"paragraph","text":"On the ground, Killian emerged from the fiery wreckage and accepted the mantle of the Mandarin moments before he was attacked by Potts, who had survived her own fall due to the enhancements of the Extremis serum. One of Stark\u0027s suits proceeded to target Potts because of her heat signature, but Potts disabled the suit, ripping out its chest repulsor core and hurling it at Killian. She then used the suit\u0027s palm-repulsor to detonate the core, disintegrating Killian on the spot.","links":[{"id":10522,"alias":"Extremis serum"}],"elements":[]},{"id":25895,"type":"paragraph","text":"Following the skirmish, Stark ordered J.A.R.V.I.S. to execute the Clean Slate protocol, self-destructing all of his remaining suits of armor.","links":[],"elements":[]}],"images":[]},{"id":16369,"title":"Aftermath","level":3,"content":[{"id":25896,"type":"paragraph","text":"Vice President Rodriguez was arrested for his complicity in the abduction and attempted assassination of President Ellis, and Trevor Slattery was taken into custody for his role in Killian\u0027s ruse. Potts later had the Extremis serum cleansed from her body, and Stark underwent surgery to remove the shrapnel near his heart, thereby eliminating his need to wear a chest-mounted Arc Reactor. Stark proceeded to hurl the device into the Pacific Ocean below the wreckage of his former mansion.","links":[{"id":10523,"alias":"Extremis serum"}],"elements":[]}],"images":[]},{"id":16370,"title":"Appearances","level":2,"content":[{"id":25897,"type":"list","text":null,"links":[],"elements":[{"id":7148,"text":"Iron Man 3","links":[]}]}],"images":[]}]},{"id":7333,"wikiaId":2190,"title":"Stark Expo 1954","url":"\/wiki\/Stark_Expo_1954","articleType":"article","teaser":"Stark Expo 1954 was a year-long symposium held in Flushing, New York during the year of 1954...","thumbnail":null,"aliases":[{"id":1460,"title":"Stark Expo 1954"}],"sections":[{"id":16460,"title":"Stark Expo 1954","level":1,"content":[{"id":26032,"type":"paragraph","text":"Stark Expo 1954 was a year-long symposium held in Flushing, New York during the year of 1954, hosted by industrialist Howard Stark.","links":[{"id":10843,"alias":"Howard Stark"}],"elements":[]}],"images":[]},{"id":16461,"title":"Appearances","level":2,"content":[{"id":26033,"type":"list","text":null,"links":[],"elements":[{"id":7233,"text":"Iron Man 2 (mentioned)","links":[]}]}],"images":[]}]},{"id":7334,"wikiaId":2189,"title":"Stark Expo 1964","url":"\/wiki\/Stark_Expo_1964","articleType":"article","teaser":"Stark Expo 1964 was a year-long symposium held in Flushing, New York during 1964, hosted by...","thumbnail":null,"aliases":[{"id":1461,"title":"Stark Expo 1964"}],"sections":[{"id":16462,"title":"Stark Expo 1964","level":1,"content":[{"id":26034,"type":"paragraph","text":"Stark Expo 1964 was a year-long symposium held in Flushing, New York during 1964, hosted by industrialist Howard Stark. It led to some of the core concepts which went into developing the various Iron Man armor suits.","links":[{"id":10844,"alias":"Howard Stark"}],"elements":[]}],"images":[]},{"id":16463,"title":"Appearances","level":2,"content":[{"id":26035,"type":"list","text":null,"links":[],"elements":[{"id":7234,"text":"Iron Man 2 (mentioned)","links":[]}]}],"images":[]}]},{"id":7335,"wikiaId":2188,"title":"Stark Expo 1974","url":"\/wiki\/Stark_Expo_1974","articleType":"article","teaser":"Stark Expo 1974 was a year-long symposium held in Flushing, New York during the year of 1974...","thumbnail":"http:\/\/img3.wikia.nocookie.net\/__cb20140315162049\/agentsofshield\/images\/thumb\/e\/eb\/Stark_expo_2010.jpg\/200px-129%2C898%2C0%2C768-Stark_expo_2010.jpg","aliases":[{"id":1462,"title":"Stark Expo 1974"}],"sections":[{"id":16464,"title":"Stark Expo 1974","level":1,"content":[{"id":26036,"type":"paragraph","text":"Stark Expo 1974 was a year-long symposium held in Flushing, New York during the year of 1974, hosted by industrialist Howard Stark. It was the last such prior to Tony Stark\u0027s 2010 revamp of the concept.","links":[{"id":10845,"alias":"Howard Stark"},{"id":10846,"alias":"Tony Stark"}],"elements":[]}],"images":[{"id":28348,"src":"http:\/\/img3.wikia.nocookie.net\/__cb20140315162049\/agentsofshield\/images\/thumb\/e\/eb\/Stark_expo_2010.jpg\/250px-Stark_expo_2010.jpg","caption":null,"elements":[]}]},{"id":16465,"title":"Appearances","level":2,"content":[{"id":26037,"type":"list","text":null,"links":[],"elements":[{"id":7235,"text":"Iron Man 2 (mentioned)","links":[]}]}],"images":[]}]},{"id":7336,"wikiaId":2187,"title":"Stark Expo 2010","url":"\/wiki\/Stark_Expo_2010","articleType":"article","teaser":"Stark Expo 2010 was a year-long symposium held in Flushing, New York during the year of 2010...","thumbnail":null,"aliases":[{"id":1463,"title":"Stark Expo 2010"}],"sections":[{"id":16466,"title":"Stark Expo 2010","level":1,"content":[{"id":26038,"type":"paragraph","text":"Stark Expo 2010 was a year-long symposium held in Flushing, New York during the year of 2010, hosted by industrialist Tony Stark.","links":[{"id":10847,"alias":"Tony Stark"}],"elements":[]}],"images":[]},{"id":16467,"title":"Appearances","level":2,"content":[{"id":26039,"type":"list","text":null,"links":[],"elements":[{"id":7236,"text":"Iron Man 2","links":[]}]}],"images":[]}]},{"id":7337,"wikiaId":2192,"title":"Stark Expo Skirmish","url":"\/wiki\/Stark_Expo_Skirmish","articleType":"article","teaser":"The Stark Expo Skirmish was an armed conflict between Tony Stark and James Rhodes (wearing...","thumbnail":null,"aliases":[{"id":1464,"title":"Stark Expo Skirmish"}],"sections":[{"id":16468,"title":"Stark Expo Skirmish","level":1,"content":[{"id":26040,"type":"paragraph","text":"The Stark Expo Skirmish was an armed conflict between Tony Stark and James Rhodes (wearing, respectively, the Iron Man Mark VI and War Machine Mark I armors) and Ivan Vanko (wearing his own Whiplash armor) and a fleet of Hammer Drones remotely controlled by him.","links":[{"id":10848,"alias":"Tony Stark"}],"elements":[]}],"images":[]},{"id":16469,"title":"Prelude","level":3,"content":[{"id":26041,"type":"paragraph","text":"After Rhodes commandeered a suit of armor from Stark and delivered it to the United States Air Force, Justin Hammer refitted the suit to create the War Machine armor. Hammer then presented the War Machine as a \u0022Variable Threat Response Battlesuit,\u0022 along with a fleet of drones created for him by Vanko, at the Stark Expo.","links":[{"id":10849,"alias":"Justin"}],"elements":[]}],"images":[]},{"id":16470,"title":"Skirmish","level":3,"content":[{"id":26042,"type":"paragraph","text":"The skirmish began moments after Stark arrived at the Expo in his Mark VI suit, at which point Vanko remotely commandeered Hammer\u0027s entire fleet of drones as well as the War Machine suit, using them to target Stark as he fled the Expo. Vanko programmed Rhodes\u0027 suit and the drones to pursue Stark, even as Rhodes relayed his involuntary movements to Stark to allow Stark to execute evasive maneuvers, and Stark instructed his suit\u0027s operating system to hack into Rhodes\u0027 suit.","links":[],"elements":[]},{"id":26043,"type":"paragraph","text":"While the aerial pursuit continued, S.H.I.E.L.D. agent Natasha Romanoff assaulted Hammer backstage, forcing him to reveal that the drones were being controlled by Vanko from Hammer\u0027s own facility in New York City. While Romanoff headed for Vanko\u0027s location with Happy Hogan driving, Pepper Potts notified the New York City Police Department and assumed control of the ground response.","links":[{"id":10850,"alias":"Natasha Romanoff"},{"id":10851,"alias":"New York City"},{"id":10852,"alias":"S.H.I.E.L.D."}],"elements":[]},{"id":26044,"type":"paragraph","text":"Vanko then deployed the grenades from dozens of drones, bombing the Expo fairgrounds, before using the large-caliber guns on another platoon of drones in an attempt to shoot down Stark. Vanko continued firing grenades into the fairgrounds until one of his drones located and locked onto a child wearing an Iron Man mask. Moments before the drone was set to fire on the child, Stark landed and blasted the drone, then launched again and fled the Expo\u0027s airspace in order to draw Vanko\u0027s drones away from the crowd.","links":[],"elements":[]},{"id":26045,"type":"paragraph","text":"Stark led the battalion of drones into an underground parking garage, causing one to crash even as War Machine opened fire on him, destroying dozens of passenger vehicles. Stark then led the drones pursuing him back to the Expo fairgrounds, where he tricked the entire platoon into crashing into an enormous globe sculpture, but he was tackled moments later in midair by the War Machine armor, causing both men to hurtle into the Oracle Corporation\u0027s bio dome, where the War Machine armor pinned Stark and opened fire.","links":[],"elements":[]},{"id":26046,"type":"paragraph","text":"Romanoff and Hogan soon reached Hammer\u0027s facility where Romanoff incapacitated eleven security agents while Hogan fought and eventually defeated one guard. They reached Vanko\u0027s holding cell to find Vanko gone, and Romanoff accessed Vanko\u0027s computer to reboot the War Machine armor, returning control of the suit back to Rhodes. Stark and Rhodes argued over strategy for a moment before a platoon of drones arrived, surrounding them and opening fire as Stark retaliated with repulsor blasts and Rhodes cut down drones with machine gun fire. Stark destroyed several drones with miniaturized missiles until he and Rhodes were nearly overrun by drones, at which point Stark discharged an arc of weaponized laser fire that destroyed every drone in the area.","links":[],"elements":[]},{"id":26047,"type":"paragraph","text":"New York Police arrived soon after to arrest Hammer, and Potts coordinated rescue efforts with the Department. From Hammer\u0027s facility, Romanoff warned Stark of an incoming threat; moments later, Vanko landed in the Oracle biodome in his Whiplash armor. Rhodes attempted to disable Vanko with a Hammer Industries warhead known as \u0022the Ex-Wife,\u0022 but the missile turned out to be a dud. Stark fired a volley of missiles, but Vanko\u0027s armor survived the blasts; Rhodes opened fire, and Vanko used his suits electrified whips to sever the War Machine\u0027s turret gun.","links":[],"elements":[]},{"id":26048,"type":"paragraph","text":"Stark attempted to lift off, but Vanko caught him with one of his whips and hurled him back to the ground. Rhodes continued firing, and Stark launched himself at Vanko, who deflected the attack; Vanko then used his whips to drag Rhodes close enough to pummel him, but Stark attacked, battering Vanko\u0027s suit. Vanko retaliated by simultaneously catching the Iron Man suit and the War Machine suit around the throats with his whips with himself between them. Stark and Rhodes then fired their palm-repulsors at one another, their energy streams colliding and detonating, blowing out the entire Oracle biodome.","links":[],"elements":[]},{"id":26049,"type":"paragraph","text":"The blast destroyed Vanko\u0027s suit, but Stark and Rhodes discovered that Vanko had set his own suit, as well as the entire fleet of drones, with self-destruct sequences. Stark and Rhodes lifted off, and Stark rushed to find Potts near a fallen drone; he landed, picked up Potts, and relaunched seconds before all of the drones detonated, flying her to the safety of a nearby rooftop.","links":[],"elements":[]}],"images":[]},{"id":16471,"title":"Aftermath","level":3,"content":[{"id":26050,"type":"paragraph","text":"Due to Stark\u0027s recklessness leading up to this encounter, Romanoff recommended that he not be recruited into S.H.I.E.L.D.\u0027s Avengers Initiative, though Director Nick Fury offered Stark an emeritus position as a consultant. Stark and Rhodes were later honored with medals presented to them in Washington, D.C. by Senator Stern.","links":[{"id":10853,"alias":"S.H.I.E.L.D."},{"id":10854,"alias":"Nick Fury"}],"elements":[]}],"images":[]},{"id":16472,"title":"Appearances","level":2,"content":[{"id":26051,"type":"list","text":null,"links":[],"elements":[{"id":7237,"text":"Iron Man 2","links":[]}]}],"images":[]}]},{"id":7386,"wikiaId":2191,"title":"Weaponized Suit Defense Program Hearings","url":"\/wiki\/Weaponized_Suit_Defense_Program_Hearings","articleType":"article","teaser":"The Weaponized Suit Defense Program Hearings were a series of congressional hearings held by the...","thumbnail":null,"aliases":[{"id":1513,"title":"Weaponized Suit Defense Program Hearings"}],"sections":[{"id":16625,"title":"Weaponized Suit Defense Program Hearings","level":1,"content":[{"id":26309,"type":"paragraph","text":"The Weaponized Suit Defense Program Hearings were a series of congressional hearings held by the Senate Armed Services Committee to determine the nature of the Iron Man suits of armor designed, built, and owned by Tony Stark. During questioning by Senator Stern (who has a personal and bitter hatred of him), Stark denied possessing \u0022a specialized weapon,\u0022 referring to his Iron Man suits instead as \u0022a high-tech prosthesis\u0022. Stern demanded that Stark turn over the Iron Man armor to the United States military, but Stark refused, insisting that he and the suit were one.","links":[{"id":11701,"alias":"Tony Stark"}],"elements":[]},{"id":26310,"type":"paragraph","text":"Stern then called Hammer Industries CEO and Defense Department contrator Justin Hammer to speak before the Committee as \u0022an expert on weapons,\u0022 and Stark questioned Hammer\u0027s qualifications. Hammer accused Stark of creating \u0022a sword with untold possibilities\u0022 while insisting that \u0022it\u0027s a shield,\u0022 claiming that America faces \u0022grave threats\u0022 that \u0022Mr. Stark will not always be able to foresee\u0022.","links":[{"id":11702,"alias":"Justin"}],"elements":[]},{"id":26311,"type":"paragraph","text":"Stern next called Lt. Col. James Rhodes to speak, citing a report on the \u0022Iron Man weapon\u0022 compiled by Rhodes and instructing Rhodes to read a specific paragraph from the report. Rhodes recited the passage: \u0022as he does not operate within any definable branch of government, Iron Man presents a potential threat to the security of both the nation and to her interests\u0022. He qualified the passage, however, by reminding the Committee that \u0022the benefits of Iron Man far outweigh the liabilities.\u0022","links":[],"elements":[]},{"id":26312,"type":"paragraph","text":"Stern then instructed Rhodes to narrate surveillance photographs of several foreign nations currently attempting to replicate Stark\u0027s technology. Stark proceeded to use his cellphone to hack the room\u0027s monitors, displaying videos showing catastrophic failures in North Korea and Iran, as well as video of Justin Hammer\u0027s own unsuccessful attempts to build an armored suit for the United States military.","links":[{"id":11703,"alias":"Justin"}],"elements":[]},{"id":26313,"type":"paragraph","text":"Hammer disconnected the monitors and Stern hastily adjourned the hearing, but Stark refused to be silenced; he called himself America\u0027s \u0022nuclear deterrent,\u0022 refused again to turn of his \u0022personal property,\u0022 and claimed that he had \u0022successfully privatized world peace\u0022,none of which entirely reassured most of his audience.","links":[],"elements":[]},{"id":26314,"type":"paragraph","text":"Three years after the Hearings, revelations involving the allegiances of Senator Stern cast new light on these proceedings. It appears, in hindsight, that at least one of the objectives of acquiring the Iron Man suits was to turn the technology over to the sleeper agency of Hydra.","links":[{"id":11704,"alias":"Hydra"}],"elements":[]}],"images":[]},{"id":16626,"title":"Appearances","level":2,"content":[{"id":26315,"type":"list","text":null,"links":[],"elements":[{"id":7492,"text":"Iron Man 2","links":[]}]}],"images":[]}]}]